In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv('merged_output.csv')

In [3]:
df.head()

         Handle  Max Rating Result
0       tourist        3979    NaN
1     Radewoosh        3752    NaN
2          Benq        3813    NaN
3       jiangly        3859    NaN
4  orzdevinwang        3697    NaN

In [4]:
filtered_df = df[df['Result'] == 'Yes']

In [5]:
filtered_df.head()

           Handle  Max Rating Result
64   FastFreeTask        2927    Yes
68          xukai        2821    Yes
77    tokusakurai        2898    Yes
95      YocyCraft        2739    Yes
104         elycx        2880    Yes

In [6]:
filtered_df.shape[0]

1449

In [7]:
df2=pd.read_csv('after_2019.csv')

In [8]:
df2.head()

         Handle  Max Rating
0       tourist        3979
1       jiangly        3859
2  orzdevinwang        3697
3     ecnerwala        3668
4  zh0ukangyang        3423

In [9]:
merged_df = filtered_df.merge(df2, on='Handle', how='inner')

In [10]:
merged_df.shape[0]

1438

In [12]:
merged_df.head()

         Handle  Max Rating_x Result  Max Rating_y
0  FastFreeTask          2927    Yes          2927
1         xukai          2821    Yes          2821
2   tokusakurai          2898    Yes          2898
3     YocyCraft          2739    Yes          2739
4         elycx          2880    Yes          2880

In [15]:
new_row = pd.Series(data={'Handle': 'agrim07', 'Max rating_x': None, 'Result': 'Yes'})
merged_df = pd.concat([merged_df, new_row.to_frame().T], ignore_index=True)

In [18]:
merged_df.to_csv('merged_output_after2019.csv', index=False)

In [19]:
merged_df.tail()

             Handle  Max Rating_x Result  Max Rating_y Max rating_x
1434           Z_ZZ        1478.0    Yes        1478.0          NaN
1435          iamsk        1403.0    Yes        1403.0          NaN
1436   catastros_64        1418.0    Yes        1418.0          NaN
1437  parametername        1482.0    Yes        1482.0          NaN
1438        agrim07           NaN    Yes           NaN         None

In [22]:
df_test=pd.read_csv('merged_output_after2019.csv')

In [23]:
df_test.tail()

             Handle  Max Rating_x Result  Max Rating_y  Max rating_x
1434           Z_ZZ        1478.0    Yes        1478.0           NaN
1435          iamsk        1403.0    Yes        1403.0           NaN
1436   catastros_64        1418.0    Yes        1418.0           NaN
1437  parametername        1482.0    Yes        1482.0           NaN
1438        agrim07        1657.0    Yes        1657.0           NaN

In [24]:
df_test = df_test.iloc[:, :-2]

In [25]:
df_test.tail()

             Handle  Max Rating_x Result
1434           Z_ZZ        1478.0    Yes
1435          iamsk        1403.0    Yes
1436   catastros_64        1418.0    Yes
1437  parametername        1482.0    Yes
1438        agrim07        1657.0    Yes

In [26]:
df_test.to_csv('merged_output_after2019.csv', index=False)